package com.example.ideapad510.sherkatquestionear.Questions.Answer;


import java.util.ArrayList;

public class QuestionsAnswersArray extends ArrayList<ShortedAnswer>{

    public QuestionsAnswersArray() {

        this.add(new ShortedAnswer("⦁\tعملكرد كارتخوان شرکت پککو به لحاظ سرعت در برقراري ارتباط و خطوط تلفن را چگونه ارزيابي مي\u200Cكنيد؟\n",
                "1: كاملاً نامناسب" , " 10: كاملاً مناسب" ,
                "TEXT", "1" ));
        this.add(new ShortedAnswer("⦁\tعملكرد بانک در واريز به موقع مبالغ فروش به حساب شما را چگونه ارزيابي مي\u200Cكنيد؟\n",
                "1: كاملاً ضعيف" , "  10: كاملاً خوب" ,
                "CHECK", "2" ));
        this.add(new ShortedAnswer("⦁\tقابليت\u200Cهاي كارتخوان پککو (خريد، دريافت موجودي، پرداخت قبض و ...) تا چه اندازه توانسته نيازهاي شما در حوزه پرداخت الكترونيك را برطرف نمايد؟\n",
                "1: اصلاً نتوانسته" , "   10: كاملاً توانسته" ,
                "RADIO", "3" ));
        this.add(new ShortedAnswer("⦁\tانجام مرتب و منظم بازرسي از كارتخوان پککو را چگونه ارزيابي مي\u200Cكنيد؟\n",
                "1: خيلي ضعيف" , "  10: خيلي خوب" ,
                "CHECK", "4" ));
        this.add(new ShortedAnswer("⦁\tتمايل و علاقهمندي كاركنان شركت و نمايندگيها و بازرسين در ارائه خدمات و پاسخگويي به نياز شما را چگونه ارزيابي ميكنيد؟\n",
                "1: خيلي ضعيف" , "  10: خيلي خوب" ,
                "CHECK", "5" ));
        this.add(new ShortedAnswer("⦁\tتمايل و علاقهمندي پرسنل شعب بانک در ارائه خدمات و پاسخگويي به نياز شما را چگونه ارزيابي ميكنيد؟\n",
                "1: خيلي ضعيف" , "  10: خيلي خوب" ,
                "CHECK","6" ));
        this.add(new ShortedAnswer("⦁\tپاسخ به نيازها، خواستهها و مشكلات شما كه از جانب كاركنان شركت، نمايندگيها و بازرسين ارائه مي\u200Cشود تا چه اندازه مورد قبول و رضايتتان است؟\n",
                "1:اصلاً" , " 10: خيلي زياد" ,
                "CHECK", "7" ));
        this.add(new ShortedAnswer("⦁\tپاسخ به نيازها، خواستهها و مشكلات شما كه از جانب پرسنل شعب بانک ارائه مي\u200Cشود تا چه اندازه مورد قبول و رضايتتان است؟\n",
                "1:اصلاً" , " 10: خيلي زياد" ,
                "RADIO","8" ));
        this.add(new ShortedAnswer("⦁\tنحوه آموزش و اطلاع رساني در خصوص استفاده و به كارگيري كارتخوان را از نظر خود و همكاران چگونه ارزيابي مينماييد؟",
                "1: خيلي ضعيف" , "  10: خيلي خوب" ,
                "RADIO", "9" ));
        this.add(new ShortedAnswer("⦁\tبه طور كلي همكاري با شركت تجارت الکترونيک پارسيان تا چه اندازه توانسته است اطمينان و آرامش خاطر شما را در استفاده از دستگاههاي كارتخوان پککو فراهم نمايد؟\n",
                "1: اصلاً موفق نبوده" , " 10: كاملاً موفق بوده" ,
                "RADIO", "10" ));
        this.add(new ShortedAnswer("⦁\tكاركنان و بازرسين شركت را (مثلاً در تعمير و راهاندازي كارتخوان پککو و ...)  تا چه اندازه ماهر مي\u200Cدانيد؟\n",
                "1:خيلي كم" , " 10: خيلي زياد" ,
                "CHECK", "11" ));
        this.add(new ShortedAnswer("⦁\tنحوه برخورد و گفتار كاركنان شركت، نمايندگي\u200Cها و بازرسين تا چه اندازه محترمانه بوده است؟\n",
                "1: كاملاً نامناسب" , " 10: كاملاً مناسب" ,
                "RADIO", "12" ));
        this.add(new ShortedAnswer("⦁\tنحوه برخورد و گفتار پرسنل شعب بانک تا چه اندازه محترمانه بوده است؟\n",
                "1: كاملاً نامناسب" , " 10: كاملاً مناسب" ,
                "RADIO", "13" ));
        this.add(new ShortedAnswer("⦁\t طراحي و زيبايي كارتخوان پککو را در مقايسه با كارتخوان ساير بانكها چگونه ارزيابي مينماييد؟\n",
                "1: خيلي ضعيف" , "  10: خيلي خوب" ,
                "CHECK", "14" ));
        this.add(new ShortedAnswer("⦁\tتجهيزات مورد استفاده\u200Cي كاركنان شركت، نمايندگي\u200Cها و بازرسين را تا اندازه زيبا و حرفه\u200Cاي مي\u200Cدانيد؟\n",
                "1: كاملاً نامناسب" , " 10: كاملاً حرفه\u200Cاي" ,
                "RADIO","15" ));
        this.add(new ShortedAnswer("تا چه ميزان پوشش ظاهري كاركنان شركت و نمايندگي\u200Cها و بازرسين را مناسب و حرفه\u200Cاي مي\u200Cدانيد؟",
                "1: اصلاً" , " 10: كاملاً حرفه\u200Cاي" ,
                "RADIO", "16" ));
        this.add(new ShortedAnswer("⦁\tتا چه ميزان پوشش ظاهري پرسنل شعب بانک را مناسب و حرفه\u200Cاي مي\u200Cدانيد؟\n",
                "1: اصلاً" , " 10: كاملاً حرفه\u200Cاي" ,
                "CHECK", "17" ));
        this.add(new ShortedAnswer("⦁\t تا چه ميزان  شركت براي شما به طور خاص، توجه ويژه\u200Cاي قائل شده است؟\n",
                "1: اصلاً در دسترس نيست" , " 10: كاملاً در دسترس است" ,
                "RADIO","18" ));
        this.add(new ShortedAnswer("⦁\tشركت و نمايندگيهاي آن را ( مراكز پاسخگوئي به پذيرنده) چقدر در دسترس خود احساس ميكنيد؟",
                "1: اصلاً در دسترس نيست" , "  10: كاملاً در دسترس است" ,
                "CHECK","19" ));
        this.add(new ShortedAnswer("⦁\t شركت تا چه ميزان توانسته در شما به عنوان مشتري علاقه\u200Cي قلبي نسبت به خود ايجاد نمايد؟  ",
                "1: اصلاً" , " 10: خيلي زياد" ,
                "RADIO","20" ));
        this.add(new ShortedAnswer("⦁\tدرصورتيكه تاكنون انتقاد و شكايتي نسبت به عملكرد كارتخوان پککو به صورت تلفني يا حضوري مطرح نمودهايد، كيفيت پاسخ دريافت شده و ميزان توجه به اظهارات شما چگونه بوده است؟\n",
                "1: كاملاً نامناسب" , "  10: كاملاً مناسب" ,
                "RADIO","21" ));
        this.add(new ShortedAnswer("سرعت رسيدگي به شكايات و انتقاداتي  كه از كارتخوان پککو  ارايه نمودهايد، چگونه ارزيابي مينماييد؟",
                "1: كاملاً نامناسب" , " 10: كاملاً مناسب" ,
                "CHECK", "22" ));
        this.add(new ShortedAnswer("⦁\t قبل از برقراري ارتباط با شركت و استفاده از خدمات آن به طور كلي ميزان انتظارات شما از شركت در چه سطحي قرار داشت؟\n",
                "1: بسيار  پايين" , "  10: بسيار بالا" ,
                "RADIO","23" ));
        this.add(new ShortedAnswer("⦁\t قبل از برقراري ارتباط با شركت و استفاده از خدمات آن انتظارات شما از قابل اعتماد بودن خدمات ارائه شده توسط شركت در چه سطحي قرار داشت؟\n",
                "1: بسيار  پايين" , " 10: بسيار بالا" ,
                "CHECK","24" ));
        this.add(new ShortedAnswer("⦁\tبطور كلي، ميزان رضايت شما  از شركت تجارت الكترونيك پارسيان چه ميزان است؟\n",
                "1: بسيار  پايين" , " 10: بسيار بالا" ,
                "RADIO","25" ));
        this.add(new ShortedAnswer("⦁\tرضايت خود از محصولات و خدمات ارائه شده به شما در مقايسه با انتظاراتي كه از شركت داشته\u200Cايد، چگونه ارزيابي مي\u200Cكنيد؟\n",
                "1: بسيار پايين\u200Cتر از انتظارات" , " 10: فراتر از حد مورد انتظار" ,
                "RADIO","26" ));
        this.add(new ShortedAnswer("⦁\tاز محصولات و خدمات ارائه شده توسط شركت در مقايسه با ايده\u200Cآل\u200Cهاي مد نظر شما، تا چه ميزان رضايت داريد؟\n",
                "1: فاصله بسيار زياد با ايده\u200Cآل\u200Cها" , " 10:منطبق بر ايده\u200Cآل\u200Cها" ,
                "CHECK","27" ));
        this.add(new ShortedAnswer("⦁\tبه طور كلي در نظر شما اعتبار نام تجاري شركت در چه سطحي قرار دارد؟\n",
                "1: كاملاً بي اعتبار" , "  10: كاملاً معتبر" ,
                "RADIO","28" ));
        this.add(new ShortedAnswer("⦁\tاعتبار نام تجاري شركت در نظر دوستان و همكاران شما در چه سطحي است؟\n",
                "1: كاملاً بي اعتبار" , " 10: كاملاً معتبر" ,
                "RADIO","29" ));
        this.add(new ShortedAnswer("⦁\tبه نظر شما اعتبار نام تجاري شركت در مقايسه با ساير شركت\u200Cهاي فعال در اين حوزه در چه سطحي قرار دارد؟\n",
                "1: از همه بي اعتبارتر است" , " 10: از همه معتبرتر است" ,
                "RADIO","30" ));
        this.add(new ShortedAnswer("⦁\tاگر خدمات جديد و مهمي در حوزه\u200Cي كارت و كارتخوان در بازار صنعت پرداخت کشور ارائه شود،  تا چه ميزان حاضريد شرکت تجارت الکترونيک پارسيان را در اولويت اول خود براي فراهم کردن اين خدمات انتخاب کنيد؟\n",
                "1: امكان ندارد انتخاب کنم" , "  10: حتماً در اولويت اول انتخاب مي\u200Fکنم" ,
                "CHECK","31" ));
        this.add(new ShortedAnswer("⦁\tاگر كسي كه روي نظر شما حساب ويژه\u200Cاي باز مي\u200Cكند از شما در مورد استفاده از كارتخوان راهنمايي بخواهد تا چه ميزان حاضريد شركت تجارت الكترونيك پارسيان را به او پيشنهاد كنيد؟\n",
                "1: امكان ندارد پارسيان را پيشنهاد كنم" , "10: با اطمينان كامل پارسيان را پيشنهاد مي\u200Cكنم" ,
                "RADIO","32" ));
        this.add(new ShortedAnswer("⦁\tاگر يكي از دوستانتان از نداشتن كارتخوان يا خوب نبودن آن شكايت داشته باشد، با چه اطميناني حاضريد او را تشويق به استفاده از كارتخوان شركت تجارت الكترونيك پارسيان نماييد؟\n",
                "1: امكان ندارد پارسيان را معرفي كنم" , " 10: با اطمينان كامل پارسيان را معرفي مي\u200Cكنم" ,
                "CHECK","33" ));

    }

}
